// 思路：从第一个元素开始跟后面的元素逐个比较，把最小或最大的冒泡到顶端, 直到没得交换为止
function bubbleSort(arr) {
  let n = arr.length
  
  // 需要 n-1 轮，因为每轮至少让一个元素到达正确位置
  for (let i = 0; i < n - 1; i++) {

    let isCompare = false //用于判断本轮循环是否发生交换
    
    // n - 1 - i是因为循环i轮后，已经有i个元素是有序的了
    for (let j = 0; j < n - 1 - i; j++) {
      if (arr[j] > arr[j + 1]) {
        [arr[j], arr[j + 1]] = [arr[j + 1], arr[j]]
        isCompare = true
      }
    }
    if (!isCompare) break; //如果没有发生交换，说明已经已经有序了，后面的不需要比较了
  }
  return arr
}

const arr = bubbleSort([3, 2, 1]) //1, 2, 3
console.log("🚀 ~ 冒泡排序.js ~ arr:", arr)
